Just to be super sure. Does the following `terraform plan` include some changes to nodes?

```tf
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kube-hetzner.hcloud_load_balancer.cluster[0] will be updated in-place
  ~ resource "hcloud_load_balancer" "cluster" {
        id                 = "1471768"
      ~ name               = "20231001t152028z-cloud-jolin-io" -> "20231001t152028z-cloud-jolin-io-traefik"
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.kube-hetzner.hcloud_network.k3s has moved to module.kube-hetzner.hcloud_network.k3s[0]
    resource "hcloud_network" "k3s" {
        id                       = "3403608"
        name                     = "20231001t152028z-cloud-jolin-io"
        # (4 unchanged attributes hidden)
    }

  # module.kube-hetzner.local_file.kustomization_backup[0] must be replaced
-/+ resource "local_file" "kustomization_backup" {
      ~ content              = <<-EOT # forces replacement
            "apiVersion": "kustomize.config.k8s.io/v1beta1"
            "kind": "Kustomization"
          - "patchesStrategicMerge":
          - - |
          -   apiVersion: apps/v1
          -   kind: Deployment
          -   metadata:
          -     name: system-upgrade-controller
          -     namespace: system-upgrade
          -   spec:
          -     template:
          -       spec:
          -         containers:
          -           - name: system-upgrade-controller
          -             volumeMounts:
          -               - name: ca-certificates
          -                 mountPath: /var/lib/ca-certificates
          -         volumes:
          -           - name: ca-certificates
          -             hostPath:
          -               path: /var/lib/ca-certificates
          -               type: Directory
          - - "kured.yaml"
          - - "ccm.yaml"
          + "patches":
          + - "patch": |
          +     apiVersion: apps/v1
          +     kind: Deployment
          +     metadata:
          +       name: system-upgrade-controller
          +       namespace: system-upgrade
          +     spec:
          +       template:
          +         spec:
          +           containers:
          +             - name: system-upgrade-controller
          +               volumeMounts:
          +                 - name: ca-certificates
          +                   mountPath: /var/lib/ca-certificates
          +           volumes:
          +             - name: ca-certificates
          +               hostPath:
          +                 path: /var/lib/ca-certificates
          +                 type: Directory
          +   "target":
          +     "group": "apps"
          +     "kind": "Deployment"
          +     "name": "system-upgrade-controller"
          +     "namespace": "system-upgrade"
          +     "version": "v1"
          + - "path": "kured.yaml"
          + - "path": "ccm.yaml"
            "resources":
            - "https://github.com/hetznercloud/hcloud-cloud-controller-manager/releases/download/v1.18.0/ccm-networks.yaml"
            - "https://github.com/kubereboot/kured/releases/download/1.14.0/kured-1.14.0-dockerhub.yaml"
            - "https://raw.githubusercontent.com/rancher/system-upgrade-controller/master/manifests/system-upgrade-controller.yaml"
            - "hcloud-csi.yml"
            - "traefik_ingress.yaml"
            - "longhorn.yaml"
            - "cert_manager.yaml"
        EOT
      ~ content_base64sha256 = "lNpUo1iYAV0KdsMXjK89vXx721X7clMRjsYcoekMh9M=" -> (known after apply)
      ~ content_base64sha512 = "qpCSZ3ofys8sSJHjJuJgfNz51WWYFeyUjxP7NpKJcxrvDNeAxukSGO7NB/+VWpDhcsrX2fTUnawkI35KCcIviA==" -> (known after apply)
      ~ content_md5          = "dfb992de46ba593c58a3be8d34bdb078" -> (known after apply)
      ~ content_sha1         = "5d34df489f16e4b4927bac5bd6a6c5b0c5f84541" -> (known after apply)
      ~ content_sha256       = "94da54a35898015d0a76c3178caf3dbd7c7bdb55fb7253118ec61ca1e90c87d3" -> (known after apply)
      ~ content_sha512       = "aa9092677a1fcacf2c4891e326e2607cdcf9d5659815ec948f13fb369289731aef0cd780c6e91218eecd07ff955a90e172cad7d9f4d49dac24237e4a09c22f88" -> (known after apply)
      ~ id                   = "5d34df489f16e4b4927bac5bd6a6c5b0c5f84541" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.kube-hetzner.null_resource.agent_config["0-0-agent-nbg1-cax41"] will be created
  + resource "null_resource" "agent_config" {
      + id       = (known after apply)
      + triggers = {
          + "agent_id" = "37727681"
          + "config"   = (sensitive value)
        }
    }

  # module.kube-hetzner.null_resource.autoscaled_nodes_registries["20231001t152028z-cloud-jolin-io-ca-nbg1-cax41-2a8faee08034e953"] will be created
  + resource "null_resource" "autoscaled_nodes_registries" {
      + id       = (known after apply)
      + triggers = {
          + "registries" = " "
        }
    }

  # module.kube-hetzner.null_resource.configure_autoscaler[0] must be replaced
-/+ resource "null_resource" "configure_autoscaler" {
      ~ id       = "4444793812316690135" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "template" = (sensitive value)
        }
    }

  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-nbg1-cax41"] will be created
  + resource "null_resource" "control_plane_config" {
      + id       = (known after apply)
      + triggers = {
          + "config"           = (sensitive value)
          + "control_plane_id" = "37727682"
        }
    }

  # module.kube-hetzner.null_resource.kustomization must be replaced
-/+ resource "null_resource" "kustomization" {
      ~ id       = "3574815439652385236" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "helm_values_yaml" = (sensitive value)
          ~ "options"          = <<-EOT
              - 
              + period=5m
              + post-reboot-node-labels=kured=done
              + pre-reboot-node-labels=kured=rebooting
              + reboot-command=/usr/bin/systemctl reboot
              + reboot-sentinel=/sentinel/reboot-required
            EOT
          ~ "versions"         = <<-EOT
                v1.26
              - v1.27.3
              + 20231027
                v1.18.0
                v2.5.1
                1.14.0
                v3.26.1
              - v1.14.0
              + 1.15.1
              + N/A
              + N/A
            EOT
        }
    }

  # module.kube-hetzner.module.agents["0-0-agent-nbg1-cax41"].null_resource.zram will be created
  + resource "null_resource" "zram" {
      + id       = (known after apply)
      + triggers = {
          + "zram_size" = ""
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-nbg1-cax41"].null_resource.zram will be created
  + resource "null_resource" "zram" {
      + id       = (known after apply)
      + triggers = {
          + "zram_size" = ""
        }
    }

Plan: 8 to add, 1 to change, 3 to destroy.
```